; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v1 - type_1 ?v2 - type_3)
 	      (pred_2 ?v8 - object ?v2 - type_3)
	      (pred_3 ?v1 - type_1 ?v7 - type_2)
	      (pred_4 ?v1 - type_1 ?v8 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_3)
       :precondition (and  (pred_1 ?v1 ?v4))
       :effect (and  (pred_1 ?v1 ?v6)
		     (not (pred_1 ?v1 ?v4))))

   (:action op_3
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_1 ?v1 ?v3) (pred_3 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_3 ?v1 ?v7))))

   (:action op_2
       :parameters (?v1 - type_1 ?v5 - object ?v3 - type_3 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v7) (pred_1 ?v1 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_3 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_14 - type_1
obj_09 obj_04 obj_05 obj_11 - type_2
obj_12 obj_03 obj_06 obj_13 - type_3
obj_08 obj_01 obj_10 obj_07 - object)
(:init
(pred_1 obj_02 obj_12)
(pred_3 obj_02 obj_09)
(pred_3 obj_02 obj_04)
(pred_1 obj_14 obj_12)
(pred_3 obj_14 obj_05)
(pred_3 obj_14 obj_11)
(pred_2 obj_08 obj_13)
(pred_2 obj_01 obj_12)
(pred_2 obj_10 obj_13)
(pred_2 obj_07 obj_03)
)
(:goal
(and
(pred_2 obj_08 obj_06)
(pred_2 obj_01 obj_13)
(pred_2 obj_10 obj_03)
(pred_2 obj_07 obj_06)
)
)

(:constraints
  (always (not (pred_1 obj_02 obj_06)))
)
)

; plan
1. (op_3 obj_02 obj_01 obj_12 obj_04)
   deleted: (pred_2 obj_01 obj_12) (pred_3 obj_02 obj_04)
   added: (pred_4 obj_02 obj_01 obj_04)
   goals met: 0 of 4
2. (op_1 obj_14 obj_12 obj_13)
   deleted: (pred_1 obj_14 obj_12)
   added: (pred_1 obj_14 obj_13)
   goals met: 0 of 4
3. (op_1 obj_02 obj_12 obj_13)
   deleted: (pred_1 obj_02 obj_12)
   added: (pred_1 obj_02 obj_13)
   goals met: 0 of 4
4. (op_3 obj_14 obj_10 obj_13 obj_11)
   deleted: (pred_2 obj_10 obj_13) (pred_3 obj_14 obj_11)
   added: (pred_4 obj_14 obj_10 obj_11)
   goals met: 0 of 4
5. (op_2 obj_02 obj_01 obj_13 obj_04)
   deleted: (pred_4 obj_02 obj_01 obj_04)
   added: (pred_2 obj_01 obj_13) (pred_3 obj_02 obj_04)
   goals met: 1 of 4
6. (op_1 obj_14 obj_13 obj_03)
   deleted: (pred_1 obj_14 obj_13)
   added: (pred_1 obj_14 obj_03)
   goals met: 1 of 4
7. (op_3 obj_02 obj_08 obj_13 obj_09)
   deleted: (pred_2 obj_08 obj_13) (pred_3 obj_02 obj_09)
   added: (pred_4 obj_02 obj_08 obj_09)
   goals met: 1 of 4
8. (op_2 obj_14 obj_10 obj_03 obj_11)
   deleted: (pred_4 obj_14 obj_10 obj_11)
   added: (pred_2 obj_10 obj_03) (pred_3 obj_14 obj_11)
   goals met: 2 of 4
9. (op_3 obj_14 obj_07 obj_03 obj_05)
   deleted: (pred_2 obj_07 obj_03) (pred_3 obj_14 obj_05)
   added: (pred_4 obj_14 obj_07 obj_05)
   goals met: 2 of 4
10. (op_2 obj_02 obj_08 obj_13 obj_09)
   deleted: (pred_4 obj_02 obj_08 obj_09)
   added: (pred_2 obj_08 obj_13) (pred_3 obj_02 obj_09)
   goals met: 2 of 4
11. (op_1 obj_14 obj_03 obj_06)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_06)
   goals met: 2 of 4
12. (op_2 obj_14 obj_07 obj_06 obj_05)
   deleted: (pred_4 obj_14 obj_07 obj_05)
   added: (pred_2 obj_07 obj_06) (pred_3 obj_14 obj_05)
   goals met: 3 of 4
13. (op_1 obj_14 obj_06 obj_13)
   deleted: (pred_1 obj_14 obj_06)
   added: (pred_1 obj_14 obj_13)
   goals met: 3 of 4
14. (op_3 obj_14 obj_08 obj_13 obj_11)
   deleted: (pred_2 obj_08 obj_13) (pred_3 obj_14 obj_11)
   added: (pred_4 obj_14 obj_08 obj_11)
   goals met: 3 of 4
15. (op_1 obj_14 obj_13 obj_06)
   deleted: (pred_1 obj_14 obj_13)
   added: (pred_1 obj_14 obj_06)
   goals met: 3 of 4
16. (op_2 obj_14 obj_08 obj_06 obj_11)
   deleted: (pred_4 obj_14 obj_08 obj_11)
   added: (pred_2 obj_08 obj_06) (pred_3 obj_14 obj_11)
   goals met: 4 of 4
